{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "import time\n",
    "import requests\n",
    "import re\n",
    "from tqdm import tqdm_notebook as tqdm"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "headers = {\n",
    "    \"Content-Type\": \"application/json\",\n",
    "    'accept': 'application/json'\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def json_load(name):\n",
    "    with open(f'{name}', 'r', encoding = 'utf-8') as f:\n",
    "        return json.load(f)\n",
    "    \n",
    "def json_save(name, item):\n",
    "    with open(f'{name}', 'w', encoding = 'utf-8') as f:\n",
    "        json.dump(item, f, ensure_ascii = False, indent = 2)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Ask QAnswer QALD questions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "qald = json_load(\"../processed_data/QALD/qald_train_wdt.json\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(217,\n",
       " {'uid': '21',\n",
       "  'question_text': 'Who wrote the book The pillars of the Earth?',\n",
       "  'query_wikidata': 'PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1163227 wdt:P50 ?uri . }',\n",
       "  'query_dbpedia': 'PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { res:The_Pillars_of_the_Earth dbo:author ?uri }',\n",
       "  'answers': '',\n",
       "  'question_text_ru': ['Кто написал книгу \"Столпы Земли\"?',\n",
       "   'Кто автор книги \"Столпы Земли\"?'],\n",
       "  'question_text_de': ['Wer schrieb die Säulen der Welt?']})"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(qald), qald[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/data/benchmarking_RuBQ/benchmarking_RuBQ-env/lib/python3.7/site-packages/ipykernel_launcher.py:4: TqdmDeprecationWarning: This function will be removed in tqdm==5.0.0\n",
      "Please use `tqdm.notebook.tqdm` instead of `tqdm.tqdm_notebook`\n",
      "  after removing the cwd from sys.path.\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "8c8380b206494488bbf7a6bbd8cff4e4",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "HBox(children=(FloatProgress(value=0.0, max=217.0), HTML(value='')))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-9-19d186f8e9ab>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m      7\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      8\u001b[0m         response = requests.get(\n\u001b[0;32m----> 9\u001b[0;31m             \u001b[0;34m\"https://qanswer-core1.univ-st-etienne.fr/api/qa/full?question={0}&lang=en&kb=wikidata\"\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mformat\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mquestion\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     10\u001b[0m         ).json()['queries']\n\u001b[1;32m     11\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/data/benchmarking_RuBQ/benchmarking_RuBQ-env/lib/python3.7/site-packages/requests/api.py\u001b[0m in \u001b[0;36mget\u001b[0;34m(url, params, **kwargs)\u001b[0m\n\u001b[1;32m     74\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     75\u001b[0m     \u001b[0mkwargs\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msetdefault\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'allow_redirects'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 76\u001b[0;31m     \u001b[0;32mreturn\u001b[0m \u001b[0mrequest\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'get'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparams\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mparams\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     77\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     78\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/data/benchmarking_RuBQ/benchmarking_RuBQ-env/lib/python3.7/site-packages/requests/api.py\u001b[0m in \u001b[0;36mrequest\u001b[0;34m(method, url, **kwargs)\u001b[0m\n\u001b[1;32m     59\u001b[0m     \u001b[0;31m# cases, and look like a memory leak in others.\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     60\u001b[0m     \u001b[0;32mwith\u001b[0m \u001b[0msessions\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mSession\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0msession\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 61\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0msession\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmethod\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mmethod\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     62\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     63\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/data/benchmarking_RuBQ/benchmarking_RuBQ-env/lib/python3.7/site-packages/requests/sessions.py\u001b[0m in \u001b[0;36mrequest\u001b[0;34m(self, method, url, params, data, headers, cookies, files, auth, timeout, allow_redirects, proxies, hooks, stream, verify, cert, json)\u001b[0m\n\u001b[1;32m    528\u001b[0m         }\n\u001b[1;32m    529\u001b[0m         \u001b[0msend_kwargs\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mupdate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msettings\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 530\u001b[0;31m         \u001b[0mresp\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mprep\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0msend_kwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    531\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    532\u001b[0m         \u001b[0;32mreturn\u001b[0m \u001b[0mresp\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/data/benchmarking_RuBQ/benchmarking_RuBQ-env/lib/python3.7/site-packages/requests/sessions.py\u001b[0m in \u001b[0;36msend\u001b[0;34m(self, request, **kwargs)\u001b[0m\n\u001b[1;32m    641\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    642\u001b[0m         \u001b[0;31m# Send the request\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 643\u001b[0;31m         \u001b[0mr\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0madapter\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    644\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    645\u001b[0m         \u001b[0;31m# Total elapsed time of the request (approximately)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/data/benchmarking_RuBQ/benchmarking_RuBQ-env/lib/python3.7/site-packages/requests/adapters.py\u001b[0m in \u001b[0;36msend\u001b[0;34m(self, request, stream, timeout, verify, cert, proxies)\u001b[0m\n\u001b[1;32m    447\u001b[0m                     \u001b[0mdecode_content\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mFalse\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    448\u001b[0m                     \u001b[0mretries\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mmax_retries\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 449\u001b[0;31m                     \u001b[0mtimeout\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mtimeout\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    450\u001b[0m                 )\n\u001b[1;32m    451\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/data/benchmarking_RuBQ/benchmarking_RuBQ-env/lib/python3.7/site-packages/urllib3/connectionpool.py\u001b[0m in \u001b[0;36murlopen\u001b[0;34m(self, method, url, body, headers, retries, redirect, assert_same_host, timeout, pool_timeout, release_conn, chunked, body_pos, **response_kw)\u001b[0m\n\u001b[1;32m    675\u001b[0m                 \u001b[0mbody\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mbody\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    676\u001b[0m                 \u001b[0mheaders\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mheaders\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 677\u001b[0;31m                 \u001b[0mchunked\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mchunked\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    678\u001b[0m             )\n\u001b[1;32m    679\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/data/benchmarking_RuBQ/benchmarking_RuBQ-env/lib/python3.7/site-packages/urllib3/connectionpool.py\u001b[0m in \u001b[0;36m_make_request\u001b[0;34m(self, conn, method, url, timeout, chunked, **httplib_request_kw)\u001b[0m\n\u001b[1;32m    424\u001b[0m                     \u001b[0;31m# Python 3 (including for exceptions like SystemExit).\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    425\u001b[0m                     \u001b[0;31m# Otherwise it looks like a bug in the code.\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 426\u001b[0;31m                     \u001b[0msix\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mraise_from\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0me\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    427\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mSocketTimeout\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mBaseSSLError\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mSocketError\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    428\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_raise_timeout\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0merr\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0me\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtimeout_value\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mread_timeout\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/data/benchmarking_RuBQ/benchmarking_RuBQ-env/lib/python3.7/site-packages/urllib3/packages/six.py\u001b[0m in \u001b[0;36mraise_from\u001b[0;34m(value, from_value)\u001b[0m\n",
      "\u001b[0;32m/data/benchmarking_RuBQ/benchmarking_RuBQ-env/lib/python3.7/site-packages/urllib3/connectionpool.py\u001b[0m in \u001b[0;36m_make_request\u001b[0;34m(self, conn, method, url, timeout, chunked, **httplib_request_kw)\u001b[0m\n\u001b[1;32m    419\u001b[0m                 \u001b[0;31m# Python 3\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    420\u001b[0m                 \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 421\u001b[0;31m                     \u001b[0mhttplib_response\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mconn\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mgetresponse\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    422\u001b[0m                 \u001b[0;32mexcept\u001b[0m \u001b[0mBaseException\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    423\u001b[0m                     \u001b[0;31m# Remove the TypeError from the exception chain in\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/usr/lib/python3.7/http/client.py\u001b[0m in \u001b[0;36mgetresponse\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m   1334\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1335\u001b[0m             \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1336\u001b[0;31m                 \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbegin\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1337\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mConnectionError\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1338\u001b[0m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mclose\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/usr/lib/python3.7/http/client.py\u001b[0m in \u001b[0;36mbegin\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    304\u001b[0m         \u001b[0;31m# read until we get a non-100 response\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    305\u001b[0m         \u001b[0;32mwhile\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 306\u001b[0;31m             \u001b[0mversion\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstatus\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreason\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_read_status\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    307\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mstatus\u001b[0m \u001b[0;34m!=\u001b[0m \u001b[0mCONTINUE\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    308\u001b[0m                 \u001b[0;32mbreak\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/usr/lib/python3.7/http/client.py\u001b[0m in \u001b[0;36m_read_status\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    265\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    266\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_read_status\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 267\u001b[0;31m         \u001b[0mline\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mstr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfp\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mreadline\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0m_MAXLINE\u001b[0m \u001b[0;34m+\u001b[0m \u001b[0;36m1\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\"iso-8859-1\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    268\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mlen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mline\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m>\u001b[0m \u001b[0m_MAXLINE\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    269\u001b[0m             \u001b[0;32mraise\u001b[0m \u001b[0mLineTooLong\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"status line\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/usr/lib/python3.7/socket.py\u001b[0m in \u001b[0;36mreadinto\u001b[0;34m(self, b)\u001b[0m\n\u001b[1;32m    587\u001b[0m         \u001b[0;32mwhile\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    588\u001b[0m             \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 589\u001b[0;31m                 \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_sock\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrecv_into\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mb\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    590\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mtimeout\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    591\u001b[0m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_timeout_occurred\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/usr/lib/python3.7/ssl.py\u001b[0m in \u001b[0;36mrecv_into\u001b[0;34m(self, buffer, nbytes, flags)\u001b[0m\n\u001b[1;32m   1050\u001b[0m                   \u001b[0;34m\"non-zero flags not allowed in calls to recv_into() on %s\"\u001b[0m \u001b[0;34m%\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1051\u001b[0m                   self.__class__)\n\u001b[0;32m-> 1052\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mnbytes\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mbuffer\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1053\u001b[0m         \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1054\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0msuper\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrecv_into\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mbuffer\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mnbytes\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mflags\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/usr/lib/python3.7/ssl.py\u001b[0m in \u001b[0;36mread\u001b[0;34m(self, len, buffer)\u001b[0m\n\u001b[1;32m    909\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    910\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mbuffer\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 911\u001b[0;31m                 \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_sslobj\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mlen\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mbuffer\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    912\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    913\u001b[0m                 \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_sslobj\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mlen\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m: "
     ]
    }
   ],
   "source": [
    "qanswer_responses = json_load(\"../processed_data/QALD/qanswer_train_responses.json\")\n",
    "ids = [q['uid'] for q in qanswer_responses]\n",
    "\n",
    "for q in tqdm(qald):\n",
    "    if q['uid'] not in ids:\n",
    "        question = q['question_text']\n",
    "\n",
    "        response = requests.get(\n",
    "            \"https://qanswer-core1.univ-st-etienne.fr/api/qa/full?question={0}&lang=en&kb=wikidata\".format(question)\n",
    "        ).json()['queries']\n",
    "\n",
    "        qanswer_responses.append({\n",
    "            'uid': q['uid'],\n",
    "            'response': [{'query': r['query'], 'confidence': r['confidence']} for r in response]\n",
    "        })\n",
    "        time.sleep(1)\n",
    "    \n",
    "json_save(\"../processed_data/QALD/qanswer_train_responses.json\", qanswer_responses)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Execute QAnswer responses"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "`python scripts/qald_run_sparql_candidates_on_wikidata.py`"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Get true answers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "sparql = SPARQLWrapper(\"https://query.wikidata.org/bigdata/namespace/wdq/sparql\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/data/benchmarking_RuBQ/benchmarking_RuBQ-env/lib/python3.7/site-packages/ipykernel_launcher.py:2: TqdmDeprecationWarning: This function will be removed in tqdm==5.0.0\n",
      "Please use `tqdm.notebook.tqdm` instead of `tqdm.tqdm_notebook`\n",
      "  \n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "94890fa4be614bcead7f64149b538646",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "HBox(children=(FloatProgress(value=0.0, max=217.0), HTML(value='')))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/data/benchmarking_RuBQ/benchmarking_RuBQ-env/lib/python3.7/site-packages/SPARQLWrapper/Wrapper.py:845: RuntimeWarning: not detected query type for query 'information not available'\n",
      "  warnings.warn(\"not detected query type for query '%s'\" % query.replace(\"\\n\", \" \"), RuntimeWarning)\n",
      "/data/benchmarking_RuBQ/benchmarking_RuBQ-env/lib/python3.7/site-packages/SPARQLWrapper/Wrapper.py:852: RuntimeWarning: unknown query type 'None'\n",
      "  warnings.warn(\"unknown query type '%s'\" % r_queryType, RuntimeWarning)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "information not available\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/data/benchmarking_RuBQ/benchmarking_RuBQ-env/lib/python3.7/site-packages/SPARQLWrapper/Wrapper.py:845: RuntimeWarning: not detected query type for query 'no data available'\n",
      "  warnings.warn(\"not detected query type for query '%s'\" % query.replace(\"\\n\", \" \"), RuntimeWarning)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "no data available\n",
      "information not available\n",
      "no data available\n",
      "no data available\n",
      "no data available\n",
      "no data available\n",
      "no data available\n",
      "no data available\n",
      "no data available\n",
      "no data available\n",
      "no data available\n",
      "SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q6256>  . ?cave <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q35509> . { ?cave <http://www.wikidata.org/prop/direct/P17> ?uri . }  UNION { ?cave <http://www.wikidata.org/prop/direct/P131>/<http://www.wikidata.org/prop/direct/P17> ?uri . } } GROUP BY ?uri HAVING (COUNT(DISTINCT ?cave) > 10)\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/data/benchmarking_RuBQ/benchmarking_RuBQ-env/lib/python3.7/site-packages/SPARQLWrapper/Wrapper.py:845: RuntimeWarning: not detected query type for query 'no information available'\n",
      "  warnings.warn(\"not detected query type for query '%s'\" % query.replace(\"\\n\", \" \"), RuntimeWarning)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "no information available\n",
      "\n"
     ]
    }
   ],
   "source": [
    "test_new = list()\n",
    "for q in tqdm(qald):\n",
    "    time.sleep(1)\n",
    "    try:\n",
    "        sparql.setQuery(q['query_wikidata'])\n",
    "        sparql.setReturnFormat(JSON)\n",
    "        results = sparql.query().convert()\n",
    "\n",
    "        answers = list()\n",
    "        if \"results\" in results.keys():\n",
    "            for result in results[\"results\"][\"bindings\"]:\n",
    "                answers.append(result)\n",
    "        elif \"boolean\" in results.keys():\n",
    "            answers = results[\"boolean\"]\n",
    "    except:\n",
    "        time.sleep(1)\n",
    "        try:\n",
    "            sparql.setQuery(q['query_wikidata'])\n",
    "            sparql.setReturnFormat(JSON)\n",
    "            results = sparql.query().convert()\n",
    "\n",
    "            answers = list()\n",
    "            if \"results\" in results.keys():\n",
    "                for result in results[\"results\"][\"bindings\"]:\n",
    "                    answers.append(result)\n",
    "            elif \"boolean\" in results.keys():\n",
    "                answers = results[\"boolean\"]\n",
    "        except:\n",
    "            print(q['query_wikidata'])\n",
    "            answers = None\n",
    "    \n",
    "    if answers:\n",
    "        q['results_wikidata'] = answers    \n",
    "        test_new.append(q)\n",
    "    else:\n",
    "        q['results_wikidata'] = None    \n",
    "        test_new.append(q)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "json_save(\"../processed_data/QALD/qald_train_wdt_answers.json\", test_new)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Get Labels from QALD"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "`python ../scripts/get_qald_labels_wikidata.py`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "test_labels = json_load(\"../processed_data/QALD/qanswer_test_responses_labels.json\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Mark if the question was correctly answered by QAnswer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "def precision_recall(true: list, pred: list):\n",
    "    \"\"\"\n",
    "    Take prediction for a given question \n",
    "    and check how many of them are good ones. \n",
    "    That number divided by number of predictions gives you the Precision.\n",
    "    \n",
    "    Recall how many true results are in predictions\n",
    "    \"\"\"\n",
    "    if len(true) == 0 and len(pred) == 0:\n",
    "        return 1, 1\n",
    "    \n",
    "    intersect = len(set(pred).intersection(set(true)))\n",
    "    precision = intersect/len(pred) if len(pred) > 0 else 0\n",
    "    recall = intersect/len(true) if len(true) > 0 else 0\n",
    "    \n",
    "    return precision, recall\n",
    "\n",
    "def find_by_uid(uid, array):\n",
    "    for q in array:\n",
    "        if uid == q['uid']:\n",
    "            return q\n",
    "    assert False"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "test_new = json_load(\"../processed_data/QALD/qald_train_wdt_answers.json\")\n",
    "qanswer_results_new = json_load(\"../processed_data/QALD/qanswer_train_responses_extended.json\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "for i in range(len(qanswer_results_new)):\n",
    "    # get true answers\n",
    "    true = list()\n",
    "    test_new_i = find_by_uid(qanswer_results_new[i]['uid'], test_new)\n",
    "    if type(test_new_i['results_wikidata']) == list:\n",
    "        for k in range(len(test_new_i['results_wikidata'])):\n",
    "            for value in list(test_new_i['results_wikidata'][k].values()):\n",
    "                if value['value'] not in true:\n",
    "                    true.append(value['value'])\n",
    "    elif type(test_new_i['results_wikidata']) == bool:\n",
    "        true = test_new_i['results_wikidata']\n",
    "        \n",
    "    # for each query candidate get predicted answers and mark if it was true\n",
    "    for j in range(len(qanswer_results_new[i]['response'])):\n",
    "        predicted = list()\n",
    "        if type(test_new_i['results_wikidata']) != type(qanswer_results_new[i]['response'][j]['result']):\n",
    "            qanswer_results_new[i]['response'][j]['is_true'] = False\n",
    "        elif type(qanswer_results_new[i]['response'][j]['result']) == list:\n",
    "            for k in range(len(qanswer_results_new[i]['response'][j]['result'])):\n",
    "                for value in list(qanswer_results_new[i]['response'][j]['result'][k].values()):\n",
    "                    if value['value'] not in predicted:\n",
    "                        predicted.append(value['value'])\n",
    "\n",
    "            prec, rec = precision_recall(true, predicted)\n",
    "            if prec >= 0.5 and rec >= 0.5: # if candidate is correct\n",
    "                qanswer_results_new[i]['response'][j]['is_true'] = True\n",
    "            else:\n",
    "                qanswer_results_new[i]['response'][j]['is_true'] = False\n",
    "        elif type(qanswer_results_new[i]['response'][j]['result']) == bool:\n",
    "            if qanswer_results_new[i]['response'][j]['result'] == true:\n",
    "                qanswer_results_new[i]['response'][j]['is_true'] = True\n",
    "            else:\n",
    "                qanswer_results_new[i]['response'][j]['is_true'] = False"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "json_save(\"../processed_data/QALD/qanswer_train_responses_extended.json\", qanswer_results_new)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [],
   "source": [
    "# load test results to TEST it\n",
    "qanswer_results_new = json_load(\"../processed_data/QALD/qanswer_test_responses_extended.json\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Evaluate the classifier"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "def precision_at_k(data, k=1):\n",
    "    \"\"\"\n",
    "    How many relevant items are present in the top-k recommendations of the system\n",
    "    \"\"\"\n",
    "    assert k > 0\n",
    "    prec = list()\n",
    "    for q in data:\n",
    "        cnt = 0\n",
    "        for i in range(len(q['response'])):\n",
    "            if i + 1 <= k: # take first k responses\n",
    "                if q['response'][i]['is_true']:\n",
    "                    cnt +=1\n",
    "        prec.append(cnt/k)\n",
    "        \n",
    "    return sum(prec)/len(prec)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(0.2882882882882883, 0.12612612612612611)"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "precision_at_k(qanswer_results_new, 1), precision_at_k(qanswer_results_new, 5) # for initial set"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "qald_test = json_load(\"../processed_data/QALD/qald_test_wdt.json\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'uid': '201',\n",
       " 'response': [{'query': 'SELECT DISTINCT ?o1 ?o2 WHERE { \\t <http://www.wikidata.org/entity/Q331630>  <http://www.wikidata.org/prop/direct/P176>  ?o1 . \\t ?o1  <http://www.wikidata.org/prop/direct/P571>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [{'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q948831'},\n",
       "     'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1992-01-01T00:00:00Z'}},\n",
       "    {'o1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q948831'},\n",
       "     'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1842-01-01T00:00:00Z'}}],\n",
       "   'is_true': True},\n",
       "  {'query': 'SELECT DISTINCT ?o2 WHERE { \\t <http://www.wikidata.org/entity/Q331630>  <http://www.wikidata.org/prop/direct/P176>  ?o1 . \\t ?o1  <http://www.wikidata.org/prop/direct/P571>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [{'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1842-01-01T00:00:00Z'}},\n",
       "    {'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1992-01-01T00:00:00Z'}}],\n",
       "   'is_true': True},\n",
       "  {'query': 'SELECT (year(?o2) as ?year)  WHERE {\\t <http://www.wikidata.org/entity/Q331630>  <http://www.wikidata.org/prop/direct/P176>  ?o1 . \\t ?o1  <http://www.wikidata.org/prop/direct/P571>  ?o2 . }    LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1842'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1992'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o2) as ?year)  WHERE {\\t ?s1  <http://www.wikidata.org/prop/direct/P1056>  <http://www.wikidata.org/entity/Q152281> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 . }    LIMIT 1000',\n",
       "   'confidence': 0.01,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1896'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1900'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1854'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1883'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1903'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?s1 ?o2 WHERE { \\t ?s1  <http://www.wikidata.org/prop/direct/P176>  <http://www.wikidata.org/entity/Q131734> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o2 WHERE { \\t ?s1  <http://www.wikidata.org/prop/direct/P176>  <http://www.wikidata.org/entity/Q131734> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o1 ?o2 WHERE { \\t <http://www.wikidata.org/entity/Q331630>  <http://www.wikidata.org/prop/direct/P176>  ?o1 . \\t ?o1  <http://www.wikidata.org/prop/direct/P571>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [{'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q948831'},\n",
       "     'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1992-01-01T00:00:00Z'}},\n",
       "    {'o1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q948831'},\n",
       "     'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1842-01-01T00:00:00Z'}}],\n",
       "   'is_true': True},\n",
       "  {'query': 'SELECT DISTINCT ?o2 WHERE { \\t <http://www.wikidata.org/entity/Q331630>  <http://www.wikidata.org/prop/direct/P176>  ?o1 . \\t ?o1  <http://www.wikidata.org/prop/direct/P571>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [{'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1842-01-01T00:00:00Z'}},\n",
       "    {'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1992-01-01T00:00:00Z'}}],\n",
       "   'is_true': True},\n",
       "  {'query': 'SELECT (year(?o2) as ?year)  WHERE {\\t ?s1  <http://www.wikidata.org/prop/direct/P176>  <http://www.wikidata.org/entity/Q131734> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 . }    LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o1 WHERE { \\t <http://www.wikidata.org/entity/Q331630>  <http://www.wikidata.org/prop/direct/P176>  ?o1 .  }  LIMIT 1000',\n",
       "   'confidence': 0.12,\n",
       "   'result': [{'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q948831'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT ?s0  WHERE { \\nVALUES ?s0 { <http://www.wikidata.org/entity/Q331630> }  }',\n",
       "   'confidence': 0.19,\n",
       "   'result': [{'s0': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q331630'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?s1 ?o2 WHERE { \\t ?s1  <http://www.wikidata.org/prop/direct/P1056>  <http://www.wikidata.org/entity/Q152281> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.01,\n",
       "   'result': [{'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q70791409'},\n",
       "     'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1900-01-01T00:00:00Z'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q85403211'},\n",
       "     'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1903-01-01T00:00:00Z'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q76385964'},\n",
       "     'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1883-01-01T00:00:00Z'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q76385918'},\n",
       "     'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1854-01-01T00:00:00Z'}},\n",
       "    {'s1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q5391577'},\n",
       "     'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1896-01-01T00:00:00Z'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o2 WHERE { \\t ?s1  <http://www.wikidata.org/prop/direct/P1056>  <http://www.wikidata.org/entity/Q152281> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.01,\n",
       "   'result': [{'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1900-01-01T00:00:00Z'}},\n",
       "    {'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1896-01-01T00:00:00Z'}},\n",
       "    {'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1883-01-01T00:00:00Z'}},\n",
       "    {'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1854-01-01T00:00:00Z'}},\n",
       "    {'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1903-01-01T00:00:00Z'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o1 WHERE { \\t <http://www.wikidata.org/entity/Q131734>  <http://www.wikidata.org/prop/direct/P1056>  ?o1 .  }  LIMIT 1000',\n",
       "   'confidence': 0.19,\n",
       "   'result': [{'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q44'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o1 ?o2 WHERE { \\t <http://www.wikidata.org/entity/Q131734>  <http://www.wikidata.org/prop/direct/P1056>  ?o1 . \\t ?o1  <http://www.wikidata.org/prop/direct/P1709>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.03,\n",
       "   'result': [{'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q44'},\n",
       "     'o2': {'type': 'uri', 'value': 'http://aims.fao.org/aos/agrovoc/c_864'}},\n",
       "    {'o1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q44'},\n",
       "     'o2': {'type': 'uri', 'value': 'http://dbpedia.org/ontology/Beer'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o2 WHERE { \\t <http://www.wikidata.org/entity/Q131734>  <http://www.wikidata.org/prop/direct/P1056>  ?o1 . \\t ?o1  <http://www.wikidata.org/prop/direct/P1709>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.03,\n",
       "   'result': [{'o2': {'type': 'uri',\n",
       "      'value': 'http://aims.fao.org/aos/agrovoc/c_864'}},\n",
       "    {'o2': {'type': 'uri', 'value': 'http://dbpedia.org/ontology/Beer'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?s1 ?o2 WHERE { \\t ?s1  <http://www.wikidata.org/prop/direct/P1056>  <http://www.wikidata.org/entity/Q152281> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.01,\n",
       "   'result': [{'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q70791409'},\n",
       "     'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1900-01-01T00:00:00Z'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q85403211'},\n",
       "     'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1903-01-01T00:00:00Z'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q76385964'},\n",
       "     'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1883-01-01T00:00:00Z'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q76385918'},\n",
       "     'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1854-01-01T00:00:00Z'}},\n",
       "    {'s1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q5391577'},\n",
       "     'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1896-01-01T00:00:00Z'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o2 WHERE { \\t ?s1  <http://www.wikidata.org/prop/direct/P1056>  <http://www.wikidata.org/entity/Q152281> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.01,\n",
       "   'result': [{'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1900-01-01T00:00:00Z'}},\n",
       "    {'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1896-01-01T00:00:00Z'}},\n",
       "    {'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1883-01-01T00:00:00Z'}},\n",
       "    {'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1854-01-01T00:00:00Z'}},\n",
       "    {'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1903-01-01T00:00:00Z'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?s1 WHERE { \\t ?s1  <http://www.wikidata.org/prop/direct/P2079>  <http://www.wikidata.org/entity/Q19435686> .  }  LIMIT 1000',\n",
       "   'confidence': 0.1,\n",
       "   'result': [{'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q89408861'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o2) as ?year)  WHERE {\\t ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q578109> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 . }    LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1998'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1992'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '2004'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o2) as ?year)  WHERE {\\t ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q57778855> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 . }    LIMIT 1000',\n",
       "   'confidence': 0.01,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1560'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1930'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1866'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1896'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1900'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1896'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1869'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1560'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1992'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1866'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1892'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1913'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1600'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1517'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1876'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o2) as ?year)  WHERE {\\t ?s1  <http://www.wikidata.org/prop/direct/P2079>  <http://www.wikidata.org/entity/Q19435686> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 . }    LIMIT 1000',\n",
       "   'confidence': 0.01,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1490'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o2) as ?year)  WHERE {\\t ?s1  <http://www.wikidata.org/prop/direct/P2079>  <http://www.wikidata.org/entity/Q19435686> . \\t ?s1  <http://www.wikidata.org/prop/direct/P570>  ?o2 . }    LIMIT 1000',\n",
       "   'confidence': 0.01,\n",
       "   'result': [],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o1 WHERE { \\t <http://www.wikidata.org/entity/Q152281>  <http://www.wikidata.org/prop/direct/P2079>  ?o1 .  }  LIMIT 1000',\n",
       "   'confidence': 0.12,\n",
       "   'result': [{'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q8240185'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?s1 ?o2 WHERE { \\t ?s1  <http://www.wikidata.org/prop/direct/P2079>  <http://www.wikidata.org/entity/Q19435686> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.01,\n",
       "   'result': [{'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q89408861'},\n",
       "     'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1490-01-01T00:00:00Z'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o2 WHERE { \\t ?s1  <http://www.wikidata.org/prop/direct/P2079>  <http://www.wikidata.org/entity/Q19435686> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.01,\n",
       "   'result': [{'o2': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1490-01-01T00:00:00Z'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?s1 ?o2 WHERE { \\t ?s1  <http://www.wikidata.org/prop/direct/P2079>  <http://www.wikidata.org/entity/Q19435686> . \\t ?s1  <http://www.wikidata.org/prop/direct/P570>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.01,\n",
       "   'result': [],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o2 WHERE { \\t ?s1  <http://www.wikidata.org/prop/direct/P2079>  <http://www.wikidata.org/entity/Q19435686> . \\t ?s1  <http://www.wikidata.org/prop/direct/P570>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.01,\n",
       "   'result': [],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?s1 WHERE { \\t ?s1  <http://www.wikidata.org/prop/direct/P1056>  <http://www.wikidata.org/entity/Q152281> . \\t ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q131734> .  }  LIMIT 1000',\n",
       "   'confidence': 0.09,\n",
       "   'result': [{'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q5391577'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q70791409'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q76385918'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q76385964'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q85403211'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o1) as ?year)  WHERE {\\t <http://www.wikidata.org/entity/Q7247680>  <http://www.wikidata.org/prop/direct/P571>  ?o1 . }    LIMIT 1000',\n",
       "   'confidence': 0.11,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1990'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o1 WHERE { \\t <http://www.wikidata.org/entity/Q11250835>  <http://www.wikidata.org/prop/direct/P740>  ?o1 .  }  LIMIT 1000',\n",
       "   'confidence': 0.11,\n",
       "   'result': [{'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q84'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o1 WHERE { \\t <http://www.wikidata.org/entity/Q331630>  <http://www.wikidata.org/prop/direct/P31>  ?o1 .  }  LIMIT 1000',\n",
       "   'confidence': 0.08,\n",
       "   'result': [{'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q167270'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o1 WHERE { \\t <http://www.wikidata.org/entity/Q7247680>  <http://www.wikidata.org/prop/direct/P571>  ?o1 .  }  LIMIT 1000',\n",
       "   'confidence': 0.1,\n",
       "   'result': [{'o1': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1990-04-06T00:00:00Z'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o2) as ?year)  WHERE {\\t ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q3282637> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 . }    LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '2014'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '2008'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1971'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1985'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '2019'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1943'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?s1 ?o2 WHERE { \\t ?s1  <http://www.wikidata.org/prop/direct/P176>  <http://www.wikidata.org/entity/Q131734> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o2 WHERE { \\t ?s1  <http://www.wikidata.org/prop/direct/P176>  <http://www.wikidata.org/entity/Q131734> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o1 WHERE { \\t <http://www.wikidata.org/entity/Q3282637>  <http://www.wikidata.org/prop/direct/P1709>  ?o1 .  }  LIMIT 1000',\n",
       "   'confidence': 0.06,\n",
       "   'result': [{'o1': {'type': 'uri',\n",
       "      'value': 'http://dbpedia.org/ontology/Producer'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o2) as ?year)  WHERE {\\t ?s1  ?p1  <http://www.wikidata.org/entity/Q331630> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 . }    LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1842'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1992'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o2) as ?year)  WHERE {\\t ?s1  ?p1  <http://www.wikidata.org/entity/Q3282637> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 . }    LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1921'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1919'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1920'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1920'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1926'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1976'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1920'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '2008'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '2014'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '2020'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1985'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1971'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '2019'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1962'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1943'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1958'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1949'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?s1 WHERE { \\t ?s1  ?p1  <http://www.wikidata.org/entity/Q131734> . \\t ?s1  <http://www.wikidata.org/prop/direct/P1056>  <http://www.wikidata.org/entity/Q152281> .  }  LIMIT 1000',\n",
       "   'confidence': 0.12,\n",
       "   'result': [{'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q5391577'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q70791409'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q76385918'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q76385964'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q85403211'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o2) as ?year)  WHERE {\\t <http://www.wikidata.org/entity/Q331630>  ?p1  ?o1 . \\t ?o1  <http://www.wikidata.org/prop/direct/P571>  ?o2 . }    LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1993'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1842'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1992'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o1) as ?year)  WHERE {\\t <http://www.wikidata.org/entity/Q64579566>  <http://www.wikidata.org/prop/direct/P571>  ?o1 . }    LIMIT 1000',\n",
       "   'confidence': 0.09,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1936'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o1) as ?year)  WHERE {\\t <http://www.wikidata.org/entity/Q76555336>  <http://www.wikidata.org/prop/direct/P571>  ?o1 . }    LIMIT 1000',\n",
       "   'confidence': 0.09,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1932'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o1 WHERE { \\t <http://www.wikidata.org/entity/Q577>  <http://www.wikidata.org/prop/direct/P1709>  ?o1 .  }  LIMIT 1000',\n",
       "   'confidence': 0.09,\n",
       "   'result': [{'o1': {'type': 'uri',\n",
       "      'value': 'http://dbpedia.org/ontology/Year'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o1 WHERE { \\t <http://www.wikidata.org/entity/Q11250835>  <http://www.wikidata.org/prop/direct/P571>  ?o1 .  }  LIMIT 1000',\n",
       "   'confidence': 0.11,\n",
       "   'result': [{'o1': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '2006-01-01T00:00:00Z'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o1 WHERE { \\t <http://www.wikidata.org/entity/Q66309232>  <http://www.wikidata.org/prop/direct/P571>  ?o1 .  }  LIMIT 1000',\n",
       "   'confidence': 0.1,\n",
       "   'result': [{'o1': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '2008-01-01T00:00:00Z'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o1 WHERE { \\t <http://www.wikidata.org/entity/Q97228886>  <http://www.wikidata.org/prop/direct/P571>  ?o1 .  }  LIMIT 1000',\n",
       "   'confidence': 0.1,\n",
       "   'result': [{'o1': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1996-03-20T00:00:00Z'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o2) as ?year)  WHERE {\\t ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q3922505> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 . }    LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '2016'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1985'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o2) as ?year)  WHERE {\\t ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q1759246> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 . }    LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1981'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1991'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o2) as ?year)  WHERE {\\t ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q1913301> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 . }    LIMIT 1000',\n",
       "   'confidence': 0.01,\n",
       "   'result': [],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?s1 WHERE { \\t ?s1  <http://www.wikidata.org/prop/direct/P1056>  <http://www.wikidata.org/entity/Q152281> .  }  LIMIT 1000',\n",
       "   'confidence': 0.08,\n",
       "   'result': [{'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q5391577'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q70791409'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q76385918'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q76385964'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q85403211'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o2) as ?year)  WHERE {\\t ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q13235160> . \\t ?s1  <http://www.wikidata.org/prop/direct/P571>  ?o2 . }    LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1928'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '2003'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1966'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1971'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1830'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1983'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1903'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1946'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1909'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1927'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1946'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '2004'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1948'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1942'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '2001'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1991'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1963'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '2001'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1951'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1891'}},\n",
       "    {'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '2003'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o1) as ?year)  WHERE {\\t <http://www.wikidata.org/entity/Q315732>  <http://www.wikidata.org/prop/direct/P577>  ?o1 . }    LIMIT 1000',\n",
       "   'confidence': 0.06,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1968'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o1) as ?year)  WHERE {\\t <http://www.wikidata.org/entity/Q11336090>  <http://www.wikidata.org/prop/direct/P571>  ?o1 . }    LIMIT 1000',\n",
       "   'confidence': 0.08,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1996'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT (year(?o2) as ?year)  WHERE {\\t <http://www.wikidata.org/entity/Q11250835>  <http://www.wikidata.org/prop/direct/P740>  ?o1 . \\t ?o1  <http://www.wikidata.org/prop/direct/P571>  ?o2 . }    LIMIT 1000',\n",
       "   'confidence': 0.01,\n",
       "   'result': [{'year': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '47'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o1 WHERE { \\t <http://www.wikidata.org/entity/Q315732>  <http://www.wikidata.org/prop/direct/P577>  ?o1 .  }  LIMIT 1000',\n",
       "   'confidence': 0.06,\n",
       "   'result': [{'o1': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '1968-01-01T00:00:00Z'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o1 WHERE { \\t <http://www.wikidata.org/entity/Q331630>  ?p1  ?o1 .  }  LIMIT 1000',\n",
       "   'confidence': 0.02,\n",
       "   'result': [{'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q167270'}},\n",
       "    {'o1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q948831'}},\n",
       "    {'o1': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '2'}},\n",
       "    {'o1': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '9'}},\n",
       "    {'o1': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '33'}},\n",
       "    {'o1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q213'}},\n",
       "    {'o1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q64745'}},\n",
       "    {'o1': {'xml:lang': 'en', 'type': 'literal', 'value': 'trademark'}},\n",
       "    {'o1': {'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "      'type': 'literal',\n",
       "      'value': '1230819245'}},\n",
       "    {'o1': {'type': 'uri',\n",
       "      'value': 'http://commons.wikimedia.org/wiki/Special:FilePath/Pilsner%20Urquell%20logo.svg'}},\n",
       "    {'o1': {'type': 'uri', 'value': 'http://g.co/kg/m/031n3s'}},\n",
       "    {'o1': {'type': 'uri', 'value': 'http://www.pilsnerurquell.com/'}},\n",
       "    {'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/statement/Q331630-171B1EC2-2276-45B4-9378-D5F11BB94D03'}},\n",
       "    {'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/statement/Q331630-293850a4-4eeb-3e62-d787-3349c11fe408'}},\n",
       "    {'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/statement/Q331630-4E0A96A6-5510-4DDD-B472-F8C98D6B2E45'}},\n",
       "    {'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/statement/Q331630-6B66131C-E864-4AD9-BBB9-FB527E812EC3'}},\n",
       "    {'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/statement/Q331630-9F152278-61C8-4F78-9901-A6DB8E6722F3'}},\n",
       "    {'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/statement/Q331630-9F3B4FAE-D9F3-4E0F-B7FC-06B0CB2C0286'}},\n",
       "    {'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/statement/q331630-C1ABC935-41FC-4DBF-806D-AC4EE7D53FCB'}},\n",
       "    {'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/statement/Q331630-eb76b6ba-450f-3ce5-0c6f-fa8bb10a82f8'}},\n",
       "    {'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/statement/Q331630-EE445024-E0E9-4939-92AB-C375A9A40873'}},\n",
       "    {'o1': {'type': 'literal', 'value': '/m/031n3s'}},\n",
       "    {'o1': {'type': 'literal', 'value': 'Pilsner-Urquell'}},\n",
       "    {'o1': {'xml:lang': 'ast', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'bg', 'type': 'literal', 'value': 'Пилзнер Урквел'}},\n",
       "    {'o1': {'xml:lang': 'ca', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'cs', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'cs',\n",
       "      'type': 'literal',\n",
       "      'value': 'Plzeňský prazdroj'}},\n",
       "    {'o1': {'xml:lang': 'cs', 'type': 'literal', 'value': 'Prazdroj'}},\n",
       "    {'o1': {'xml:lang': 'da', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'de', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'en', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'eo', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'es', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'eu', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'fa', 'type': 'literal', 'value': 'پیلزنر اورکوئل'}},\n",
       "    {'o1': {'xml:lang': 'fa', 'type': 'literal', 'value': 'پیلسنر ارکل'}},\n",
       "    {'o1': {'xml:lang': 'fi', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'fr',\n",
       "      'type': 'literal',\n",
       "      'value': 'Bürgerlichen Brauhaus'}},\n",
       "    {'o1': {'xml:lang': 'fr', 'type': 'literal', 'value': 'České Pivo'}},\n",
       "    {'o1': {'xml:lang': 'fr',\n",
       "      'type': 'literal',\n",
       "      'value': 'entreprise brassicole tchèque'}},\n",
       "    {'o1': {'xml:lang': 'fr', 'type': 'literal', 'value': 'Pilsen Urquell'}},\n",
       "    {'o1': {'xml:lang': 'fr', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'fr',\n",
       "      'type': 'literal',\n",
       "      'value': 'Plzeňské pivovary'}},\n",
       "    {'o1': {'xml:lang': 'fr',\n",
       "      'type': 'literal',\n",
       "      'value': 'Plzensky Prazdroj'}},\n",
       "    {'o1': {'xml:lang': 'fr',\n",
       "      'type': 'literal',\n",
       "      'value': 'Plzeňský Prazdroj'}},\n",
       "    {'o1': {'xml:lang': 'hr', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'hu', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'it', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'ja', 'type': 'literal', 'value': 'ピルスナー・ウルケル'}},\n",
       "    {'o1': {'xml:lang': 'ja', 'type': 'literal', 'value': 'ピルスナーウルケル'}},\n",
       "    {'o1': {'xml:lang': 'ko', 'type': 'literal', 'value': '필스너 우르켈'}},\n",
       "    {'o1': {'xml:lang': 'lb', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'lmo',\n",
       "      'type': 'literal',\n",
       "      'value': 'Bürgerlichen Brauhaus'}},\n",
       "    {'o1': {'xml:lang': 'lmo', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'nb', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'nl', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'pcd', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'pl', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'pt', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'ru', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'sk', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'sk', 'type': 'literal', 'value': 'Prazdroj'}},\n",
       "    {'o1': {'xml:lang': 'sv', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'uk', 'type': 'literal', 'value': 'Pilsner Urquell'}},\n",
       "    {'o1': {'xml:lang': 'vi',\n",
       "      'type': 'literal',\n",
       "      'value': 'Plzeňský Prazdroj'}},\n",
       "    {'o1': {'xml:lang': 'zh', 'type': 'literal', 'value': '皮爾森歐克'}},\n",
       "    {'o1': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '2020-07-13T13:37:36Z'}},\n",
       "    {'o1': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime',\n",
       "      'type': 'literal',\n",
       "      'value': '2020-07-13T13:37:51Z'}},\n",
       "    {'o1': {'xml:lang': 'en', 'type': 'literal', 'value': 'Buffy beer'}},\n",
       "    {'o1': {'xml:lang': 'sv',\n",
       "      'type': 'literal',\n",
       "      'value': 'tjeckiskt ölmärke'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?s1 WHERE { \\t ?s1  ?p1  <http://www.wikidata.org/entity/Q331630> .  }  LIMIT 1000',\n",
       "   'confidence': 0.02,\n",
       "   'result': [{'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/statement/Q948831-422208a1-4e79-67b9-d7b3-b6dcd7c6f52c'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://ast.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://bg.wikipedia.org/wiki/%D0%9F%D0%B8%D0%BB%D0%B7%D0%BD%D0%B5%D1%80_%D0%A3%D1%80%D0%BA%D0%B2%D0%B5%D0%BB'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://ca.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri', 'value': 'https://cs.wikipedia.org/wiki/Prazdroj'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://cs.wikiquote.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://da.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://de.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://en.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://eo.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://es.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://eu.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://fa.wikipedia.org/wiki/%D9%BE%DB%8C%D9%84%D8%B2%D9%86%D8%B1_%D8%A7%D9%88%D8%B1%DA%A9%D9%88%D8%A6%D9%84'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://fi.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://fr.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://hr.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://hu.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://it.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://ja.wikipedia.org/wiki/%E3%83%94%E3%83%AB%E3%82%B9%E3%83%8A%E3%83%BC%E3%83%BB%E3%82%A6%E3%83%AB%E3%82%B1%E3%83%AB'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://ko.wikipedia.org/wiki/%ED%95%84%EC%8A%A4%EB%84%88_%EC%9A%B0%EB%A5%B4%EC%BC%88'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://lb.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://lmo.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://nl.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://no.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://pcd.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://pl.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://pt.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://ru.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://simple.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri', 'value': 'https://sk.wikipedia.org/wiki/Prazdroj'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://sv.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://uk.wikipedia.org/wiki/Pilsner_Urquell'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://vi.wikipedia.org/wiki/Plze%C5%88sk%C3%BD_Prazdroj'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'https://zh.wikipedia.org/wiki/%E7%9A%AE%E7%88%BE%E6%A3%AE%E6%AD%90%E5%85%8B'}},\n",
       "    {'s1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q948831'}},\n",
       "    {'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q17249271'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?o1 WHERE { \\t <http://www.wikidata.org/entity/Q4384042>  <http://www.wikidata.org/prop/direct/P1056>  ?o1 .  }  LIMIT 1000',\n",
       "   'confidence': 0.05,\n",
       "   'result': [{'o1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q3966'}}],\n",
       "   'is_true': False},\n",
       "  {'query': 'SELECT DISTINCT ?s1 ?o2 WHERE { \\t ?s1  <http://www.wikidata.org/prop/direct/P176>  <http://www.wikidata.org/entity/Q131734> . \\t ?s1  <http://www.wikidata.org/prop/direct/P1709>  ?o2 .  }  LIMIT 1000',\n",
       "   'confidence': 0.0,\n",
       "   'result': [{'s1': {'type': 'uri',\n",
       "      'value': 'http://www.wikidata.org/entity/Q44'},\n",
       "     'o2': {'type': 'uri', 'value': 'http://aims.fao.org/aos/agrovoc/c_864'}},\n",
       "    {'s1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q44'},\n",
       "     'o2': {'type': 'uri', 'value': 'http://dbpedia.org/ontology/Beer'}}],\n",
       "   'is_true': False}]}"
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qanswer_results_new[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/data/benchmarking_RuBQ/benchmarking_RuBQ-env/lib/python3.7/site-packages/ipykernel_launcher.py:4: TqdmDeprecationWarning: This function will be removed in tqdm==5.0.0\n",
      "Please use `tqdm.notebook.tqdm` instead of `tqdm.tqdm_notebook`\n",
      "  after removing the cwd from sys.path.\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "caaea4b674074f2ab8a1bc55870f7344",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "HBox(children=(FloatProgress(value=0.0, max=111.0), HTML(value='')))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "# filter answer candidates and create new dataset for evaluation\n",
    "qanswer_results_filtered = list()\n",
    "\n",
    "for i in tqdm(range(len(qanswer_results_new))):\n",
    "    question_text = qald_test[i]['question_text']\n",
    "    batch = list()\n",
    "    for j in range(len(test_labels[i]['responses'])):\n",
    "        answer_text = ' '.join(t for t in test_labels[i]['responses'][j])\n",
    "        batch.append([question_text, answer_text])\n",
    "    \n",
    "    data = json.dumps(batch, ensure_ascii=False)\n",
    "    data = data.encode('ascii', 'ignore').strip()\n",
    "\n",
    "    json_response = requests.post('http://webengineering.ins.hs-anhalt.de:41003/predict',\n",
    "                                  data=data,\n",
    "                                  headers=headers)\n",
    "\n",
    "    preds = json_response.json()['predictions'] # get predictions for the q-a tuples set\n",
    "    answers = list()\n",
    "    for j in range(len(preds)):\n",
    "        if preds[j]:\n",
    "            answers.append({'is_true': qanswer_results_new[i]['response'][j]['is_true']})\n",
    "    qanswer_results_filtered.append({'response': answers})\n",
    "    \n",
    "# qanswer_results_filtered = [{'response': q} for q in qanswer_results_filtered]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(0.2072072072072072, 0.09729729729729727)"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "precision_at_k(qanswer_results_filtered, k=1), precision_at_k(qanswer_results_filtered, k=5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
